// Дана 2D сеточная карта, состоящая из "1" (земля) и "0" (вода).
// Подсчитайте количество островов.
// Остров окружен водой и образован соединением соседних земель по горизонтали или вертикали.
//
// Примечание:
// - Все четыре края сетки окружены водой.

object Task15 {
  def solution(grid: Array[Array[Char]]): Int = {
    1
  }

  val grid1 = Array(
    Array('1','1','1','1','0'),
    Array('1','1','0','1','0'),
    Array('1','1','0','0','0'),
    Array('0','0','0','0','0')
  )

  println(s"Task 15 = ${solution(grid1)}")
  // Task 15 = 1

  val grid2 = Array(
    Array('1','1','0','0','0'),
    Array('1','1','0','0','0'),
    Array('0','0','1','0','0'),
    Array('0','0','0','1','1')
  )

  println(s"Task 15 = ${solution(grid2)}")
  // Task 15 = 3
}
